{"article":{"/home/lab/fedorsarafanov.github.com/src/article/about.html":"<h1>О блоге и авторе</h1>\n<!--tags:js-->\n<!--d-->  \nДобро пожаловать, дорогой читатель!   \n    \nЭтот блог создан для нескольких целей.         \n \nПервая - это публикация решений вузовских задач по физике и прочих материалов, в том числе, статей и книг (как переведенных и/или скопированных, так и оригинальных).\n \nВторая - это полезная информация по компьютерным темам: железо, программирование - linux, bash, node.js, javascript, python, веб -  html5, css3 и многие другие интересные вещи, до которых у меня доберутся руки написать сюда пост. \n<!--ed-->  \n\n## Об авторе  \n<img src=\"/img/i.png\" alt=\"Сарафанов Ф.Г.\">\n\nЕсли мы не знакомы, скажу пару слов о себе. \n\nРодился в г. Нижнем Новгороде 30 августа 1998 года. \n\nНациональность — русский. \n\nОбразование — учусь на радиофизическом факультете ННГУ им. Лобачевского.\n\n### Хобби \n\nЗанимаюсь системным и веб-программированием. \n\nСчитаю, что программирование должно быть не целевым предметом, а инструментом, позволяющим сделать много интересного и полезного, причем - быстро и эффективно. \n\n### Предпочтения\n\nВ качестве языка разметки предпочитаю LaTeX и markdown. LaTeX позволяет получить безупречное качество научных публикаций. О нем в этом блоге тоже будут заметки. \n\nMarkdown удобен для написания этих постов, позволяя (как это делает и LaTeX) абстрагироваться от верстки, сосредоточившись на содержимом и возложив генерацию верстки по заданному шаблону на компьютер.","/home/lab/fedorsarafanov.github.com/src/article/datemodification.html":"<h1>Смена времени модификации / создания файла в Linux</h1>\n<!--tags:linux-->\n<!--d-->  \n`touch -a -m -t 201701011212.00 fileName.ext`\n\nгде параметры:\n\n`-a = accessed` (доступ)\n\n`-m = modified` (модификация)\n\n`-t = timestamp` (форматированное время: `[[CC]YY]MMDDhhmm[.ss]`)\n\n<!--ed-->  ","/home/lab/fedorsarafanov.github.com/src/article/bashhistory.html":"<h1>Настройка истории bash</h1>\n<!--tags:bash-->\n<!--d-->  \nМожно облегчить себе пользование терминалом, нехитрым образом настроив bash и используя некоторые удобные команды.\n<!--ed-->\n\nВсе команды дописываются в  файл `~/bashrc`.\n\n## Размер истории\n\n```bash\nHISTSIZE=5000\nHISTFILESIZE=10000\n```\nПервая определяет количество команд, хранимых в памяти, вторая — в файле.\n\n## Запись истории\n\n```bash\nshopt -s histappend\n```\n\nЕсли опция `histappend` выставлена - история команд будет добавлена в файл `$HISTFILE`, в противном случае файл будет перезаписан. Опция по умолчанию отключена.\n\n## Фильтрация истории\n\n```bash\nHISTCONTROL=\"ignoredups\"\n```\n\n`$HISTCONTROL` управляет сохранением истории. Есть несколько других полезных опций, например \n\n- `ignorespace`, команды которые начинаются с пробела не будут сохраняться\n- `erasedups`, все предыдущие команды, которые совпадают с текущей будут удалены из истории.\n\n`$HISTIGNORE` позволяет через точку с запятой записать команды, которые не должны попасть в историю.\n\n## Посткоманды\n\n```bash\nPROMPT_COMMAND=\"history -n; history -w; history -c; history -r; $PROMPT_COMMAND\"\n```\n\nВ bash есть одна малоизвестная переменная с названием `$PROMPT_COMMAND`, назначение которой — выполнение какой-то команды перед выводом приглашения, заданного переменной `$PS1`. В этой переменной можно задать скрипт, который будет выполняться перед каждым выводом приглашения для новой команды.\n\n## Итоговое решение\n\nТакая настройка обеспечивает многотерминальную работу с синхронизацией истории и удалением дубликатов.\n\n\tHISTSIZE=5000\n\tHISTFILESIZE=40000\n\tshopt -s histappend\n\tHISTCONTROL=ignoredups:erasedups\n\tPROMPT_COMMAND=\"history -n; history -w; history -c; history -r; $PROMPT_COMMAND\"\n\nЧтобы применить настройки без выхода из сессии X, достаточно выполнить\n\n\tsource ~/.bashrc\n\n\n## Удобные команды \n\n`Ctrl-R` в bash запускает поиск по истории команд. \n\nКоманда \n```bash\ncd -\n```\nвозвращает к последней посещенной директории. \n\n`Esc+.` вызывает последний упомянутый объект. \n\nНапример, если набрать\n```bash\ncat /etc/apt/sources.list\n```\nа затем rm и нажать `Esc+.`, то команда будет автоматически завершена:\n```bash\nrm /etc/apt/sources.list\n```"}}
